IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM12_CONTROLSS_G3_EPWM12.xml
	<register id="CONTROLSS_G3_EPWM12_ETFRC" acronym="CONTROLSS_G3_EPWM12_ETFRC" offset="0x158" width="16" description="Event Trigger Force Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="SOCB Force Bit  The SOCB pulse will only be generated if the event is enabled in the ETSEL register. The ETFLG[SOCB] flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates a pulse on EPWMxSOCB and set the SOCBFLG bit. This bit is used for test purposes." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="SOCA Force Bit  The SOCA pulse will only be generated if the event is enabled in the ETSEL register. The ETFLG[SOCA] flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates a pulse on EPWMxSOCA and set the SOCAFLG bit. This bit is used for test purposes." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="INT Force Bit  The interrupt will only be generated if the event is enabled in the ETSEL register. The INT flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates an interrupt on EPWMxINT and set the INT flag bit. This bit is used for test purposes." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G3_EPWM12_ETINTPS" acronym="CONTROLSS_G3_EPWM12_ETINTPS" offset="0x15C" width="16" description="Event-Trigger Interrupt Pre-Scale Register">
		<bitfield id="INTCNT2" width="4" begin="7" end="4" resetval="0x0" description="EPWMxINT Counter 2  When ETPS[INTPSSEL]=1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="7 - 4" rwaccess="R"/> 
		<bitfield id="INTPRD2" width="4" begin="3" end="0" resetval="0x0" description="EPWMxINT Period 2 Select  When ETPS[INTPSSEL] = 1, these bits select how many selected events need to occur before an interrupt is generated:   0000: Disable counter  0001: Generate interrupt on INTCNT = 1 [first event]  0010: Generate interrupt on INTCNT = 2 [second event]  0011: Generate interrupt on INTCNT = 3 [third event]  0100: Generate interrupt on INTCNT = 4 [fourth event]  ...  1111: Generate interrupt on INTCNT = 15 [fifteenth event]" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM12_ETSOCPS" acronym="CONTROLSS_G3_EPWM12_ETSOCPS" offset="0x160" width="16" description="Event-Trigger SOC Pre-Scale Register">
		<bitfield id="SOCBCNT2" width="4" begin="15" end="12" resetval="0x0" description="EPWMxSOCB Counter 2  When ETPS[SOCPSSEL] = 1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="15 - 12" rwaccess="R"/> 
		<bitfield id="SOCBPRD2" width="4" begin="11" end="8" resetval="0x0" description="EPWMxSOCB Period 2 Select  When ETPS[SOCPSSEL] = 1, these bits select how many selected event need to occur before an SOCB pulse is generated:   0000: Disable counter  0001: Generate interrupt on SOCBCNT2 = 1 [first event]  0010: Generate interrupt on SOCBCNT2 = 2 [second event]  0011: Generate interrupt on SOCBCNT2 = 3 [third event]  0100: Generate interrupt on SOCBCNT2 = 4 [fourth event]  ...  1111: Generate interrupt on SOCBCNT2 = 15 [fifteenth event]" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="SOCACNT2" width="4" begin="7" end="4" resetval="0x0" description="EPWMxSOCA Counter 2  When ETPS[SOCPSSEL] = 1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="7 - 4" rwaccess="R"/> 
		<bitfield id="SOCAPRD2" width="4" begin="3" end="0" resetval="0x0" description="EPWMxSOCA Period 2 Select  When ETPS[SOCPSSEL] = 1, these bits select how many selected event need to occur before an SOCA pulse is generated:   0000: Disable counter  0001: Generate interrupt on SOCACNT2 = 1 [first event]  0010: Generate interrupt on SOCACNT2 = 2 [second event]  0011: Generate interrupt on SOCACNT2 = 3 [third event]  0100: Generate interrupt on SOCACNT2 = 4 [fourth event]  ...  1111: Generate interrupt on SOCACNT2 = 15 [fifteenth event]" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM12_ETCNTINITCTL" acronym="CONTROLSS_G3_EPWM12_ETCNTINITCTL" offset="0x164" width="16" description="Event-Trigger Counter Initialization Control Register">
		<bitfield id="SOCBINITEN" width="1" begin="15" end="15" resetval="0x0" description="EPWMxSOCB Counter 2 Initialization Enable   0: Has no effect.  1: Enable initialization of EPWMxSOCB counter with contents of ETCNTINIT[SOCBINIT] on a SYNC event or software force." range="15" rwaccess="R/W"/> 
		<bitfield id="SOCAINITEN" width="1" begin="14" end="14" resetval="0x0" description="EPWMxSOCA Counter 2 Initialization Enable   0: Has no effect.  1: Enable initialization of EPWMxSOCA counter with contents of ETCNTINIT[SOCAINIT] on a SYNC event or software force." range="14" rwaccess="R/W"/> 
		<bitfield id="INTINITEN" width="1" begin="13" end="13" resetval="0x0" description="EPWMxINT Counter 2 Initialization Enable   0: Has no effect.  1: Enable initialization of EPWMxINT counter 2 with contents of ETCNTINIT[INTINIT] on a SYNC event or software force." range="13" rwaccess="R/W"/> 
		<bitfield id="SOCBINITFRC" width="1" begin="12" end="12" resetval="0x0" description="EPWMxSOCB Counter 2 Initialization Force   0: Has no effect.  1: This bit forces the ET EPWMxSOCB counter to be initialized with the contents of ETCNTINIT[SOCBINIT]." range="12" rwaccess="R/W1TS"/> 
		<bitfield id="SOCAINITFRC" width="1" begin="11" end="11" resetval="0x0" description="EPWMxSOCA Counter 2 Initialization Force   0: Has no effect.  1: This bit forces the ET EPWMxSOCA counter to be initialized with the contents of ETCNTINIT[SOCAINIT]." range="11" rwaccess="R/W1TS"/> 
		<bitfield id="INTINITFRC" width="1" begin="10" end="10" resetval="0x0" description="EPWMxINT Counter 2 Initialization Force   0: Has no effect.  1: This bit forces the ET EPWMxINT counter to be initialized with the contents of ETCNTINIT[INTINIT]." range="10" rwaccess="R/W1TS"/>
	</register>
