IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM12_CONTROLSS_G3_EPWM12.xml
	<register id="CONTROLSS_G3_EPWM12_ETCNTINIT" acronym="CONTROLSS_G3_EPWM12_ETCNTINIT" offset="0x168" width="16" description="Event-Trigger Counter Initialization Register">
		<bitfield id="SOCBINIT" width="4" begin="11" end="8" resetval="0x0" description="EPWMxSOCB Counter 2 Initialization Bits  The ET EPWMxSOCB counter is initialized with the contents of this register on an ePWM SYNC event or a software force." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="SOCAINIT" width="4" begin="7" end="4" resetval="0x0" description="EPWMxSOCA Counter 2 Initialization Bits  The ET EPWMxSOCA counter is initialized with the contents of this register on an ePWM SYNC event or a software force." range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="INTINIT" width="4" begin="3" end="0" resetval="0x0" description="EPWMxINT Counter 2 Initialization Bits  The ET EPWMxINT counter is initialized with the contents of this register on an ePWM SYNC event or a software force." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM12_ETINTMIXEN" acronym="CONTROLSS_G3_EPWM12_ETINTMIXEN" offset="0x16C" width="16" description="Event-Trigger Mixed INT Selection">
		<bitfield id="DCAEVT1" width="1" begin="10" end="10" resetval="0x0" description="Enable DCAEVT1.inter to the mixed ET interrupt trigger signal [ETINTMIX].    0: DCAEVT1.soc event is not enabled  1: Enable DCAEVT1.soc event" range="10" rwaccess="R/W"/> 
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x1" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the mixed ET interrupt trigger signal [ETINTMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x1" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the mixed ET interrupt trigger signal [ETINTMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM12_ETSOCAMIXEN" acronym="CONTROLSS_G3_EPWM12_ETSOCAMIXEN" offset="0x170" width="16" description="Event-Trigger Mixed SOCA Selection">
		<bitfield id="DCAEVT1" width="1" begin="10" end="10" resetval="0x0" description="Enable DCAEVT1.inter to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: DCAEVT1.soc event is not enabled  1: Enable DCAEVT1.soc event" range="10" rwaccess="R/W"/> 
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x1" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x1" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM12_ETSOCBMIXEN" acronym="CONTROLSS_G3_EPWM12_ETSOCBMIXEN" offset="0x174" width="16" description="Event-Trigger Mixed SOCB Selection">
		<bitfield id="DCBEVT1" width="1" begin="10" end="10" resetval="0x0" description="Enable DCBEVT1.inter to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: DCBEVT1.soc event is not enabled  1: Enable DCBEVT1.soc event" range="10" rwaccess="R/W"/> 
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x1" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x1" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM12_DCTRIPSEL" acronym="CONTROLSS_G3_EPWM12_DCTRIPSEL" offset="0x180" width="16" description="Digital Compare Trip Select Register">
		<bitfield id="DCBLCOMPSEL" width="4" begin="15" end="12" resetval="0x0" description="Digital Compare B Low Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by DCBLTRIPSEL register ORed together]" range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="DCBHCOMPSEL" width="4" begin="11" end="8" resetval="0x0" description="Digital Compare B High Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by DCBHTRIPSEL register ORed together]" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="DCALCOMPSEL" width="4" begin="7" end="4" resetval="0x0" description="Digital Compare A Low Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by DCALTRIPSEL register ORed together]" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="DCAHCOMPSEL" width="4" begin="3" end="0" resetval="0x0" description="Digital Compare A High Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by DCAHTRIPSEL register ORed together]" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM12_DCACTL" acronym="CONTROLSS_G3_EPWM12_DCACTL" offset="0x186" width="16" description="Digital Compare A Control Register">
		<bitfield id="EVT2LAT" width="1" begin="15" end="15" resetval="0x0" description="Indicates the status of DCAEVT2LAT signal.   0  The DCAEVT2LAT latch is cleared.   1  The DCAEVT2LAT latch is set." range="15" rwaccess="R"/> 
		<bitfield id="EVT2LATCLRSEL" width="2" begin="14" end="13" resetval="0x0" description="DCAEVT2 Latched clear source select: 00 CNT_ZERO event clears DCAEVT2 latch. 01 PRD_EQ event clears DCAEVT2 latch. 10          CNT_ZERO event or PRD_EQ event clears DCAEVT2 latch. 11          Reserved." range="14 - 13" rwaccess="R/W"/> 
		<bitfield id="EVT2LATSEL" width="1" begin="12" end="12" resetval="0x0" description="DCAEVT2 Latched signal select: 0 Does not select the DCAEVT2 latched signal [Refer figure Modifications to DCAEVT1.force/DCAEVT2.force generation.]     as source of DCAEVT2.force. 1 Selects the DCAEVT2 latched signal as source of DCAEVT2.force." range="12" rwaccess="R/W"/> 
		<bitfield id="EVT2FRCSYNCSEL" width="1" begin="9" end="9" resetval="0x0" description="DCAEVT2 Force Synchronization Signal Select  0: Source is synchronized with EPWMCLK 1: Source is passed through asynchronously" range="9" rwaccess="R/W"/> 
		<bitfield id="EVT2SRCSEL" width="1" begin="8" end="8" resetval="0x0" description="DCAEVT2 Source Signal Select   0: Source Is DCAEVT2 Signal  1: Source Is DCEVTFILT Signal" range="8" rwaccess="R/W"/> 
		<bitfield id="EVT1LAT" width="1" begin="7" end="7" resetval="0x0" description="Indicates the status of DCAEVT1LAT signal.   0  The DCAEVT1LAT latch is cleared.   1  The DCAEVT1LAT latch is set." range="7" rwaccess="R"/> 
		<bitfield id="EVT1LATCLRSEL" width="2" begin="6" end="5" resetval="0x0" description="DCAEVT1 Latched clear source select: 00 CNT_ZERO event clears DCAEVT1 latch. 01 PRD_EQ event clears DCAEVT1 latch. 10          CNT_ZERO event or PRD_EQ event clears DCAEVT1 latch. 11          Reserved." range="6 - 5" rwaccess="R/W"/> 
		<bitfield id="EVT1LATSEL" width="1" begin="4" end="4" resetval="0x0" description="DCAEVT1 Latched signal select: 0 Does not select the DCAEVT1 latched signal [Refer figure Modifications to DCAEVT1.force/DCAEVT2.force generation.]  as source of DCAEVT1.force. 1 Selects the DCAEVT1 latched signal as source of DCAEVT1.force." range="4" rwaccess="R/W"/> 
		<bitfield id="EVT1SYNCE" width="1" begin="3" end="3" resetval="0x0" description="DCAEVT1 SYNC, Enable/Disable   0: SYNC Generation Disabled  1: SYNC Generation Enabled" range="3" rwaccess="R/W"/> 
		<bitfield id="EVT1SOCE" width="1" begin="2" end="2" resetval="0x0" description="DCAEVT1 SOC, Enable/Disable   0: SOC Generation Disabled  1: SOC Generation Enabled" range="2" rwaccess="R/W"/> 
		<bitfield id="EVT1FRCSYNCSEL" width="1" begin="1" end="1" resetval="0x0" description="DCAEVT1 Force Synchronization Signal Select  0: Source is synchronized with EPWMCLK 1: Source is passed through asynchronously" range="1" rwaccess="R/W"/> 
		<bitfield id="EVT1SRCSEL" width="1" begin="0" end="0" resetval="0x0" description="DCAEVT1 Source Signal Select   0: Source Is DCAEVT1 Signal  1: Source Is DCEVTFILT Signal" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM12_DCBCTL" acronym="CONTROLSS_G3_EPWM12_DCBCTL" offset="0x188" width="16" description="Digital Compare B Control Register">
		<bitfield id="EVT2LAT" width="1" begin="15" end="15" resetval="0x0" description="Indicates the status of DCBEVT2LAT signal.   0  The DCBEVT2LAT latch is cleared.   1  The DCBEVT2LAT latch is set." range="15" rwaccess="R"/> 
		<bitfield id="EVT2LATCLRSEL" width="2" begin="14" end="13" resetval="0x0" description="DCBEVT2 Latched clear source select: 00 CNT_ZERO event clears DCBEVT2 latch. 01 PRD_EQ event clears DCBEVT2 latch. 10          CNT_ZERO event or PRD_EQ event clears DCBEVT2 latch. 11          Reserved." range="14 - 13" rwaccess="R/W"/> 
		<bitfield id="EVT2LATSEL" width="1" begin="12" end="12" resetval="0x0" description="DCBEVT2 Latched signal select: 0 Does not select the DCBEVT2 latched signal [Refer figure Modifications to DCBEVT1.force/DCBEVT2.force generation.]     as source of DCBEVT2.force. 1 Selects the DCBEVT2 latched signal as source of DCBEVT2.force." range="12" rwaccess="R/W"/> 
		<bitfield id="EVT2FRCSYNCSEL" width="1" begin="9" end="9" resetval="0x0" description="DCBEVT2 Force Synchronization Signal Select  0: Source is synchronized with EPWMCLK 1: Source is passed through asynchronously" range="9" rwaccess="R/W"/> 
		<bitfield id="EVT2SRCSEL" width="1" begin="8" end="8" resetval="0x0" description="DCBEVT2 Source Signal Select   0: Source Is DCBEVT2 Signal  1: Source Is DCEVTFILT Signal" range="8" rwaccess="R/W"/> 
		<bitfield id="EVT1LAT" width="1" begin="7" end="7" resetval="0x0" description="Indicates the status of DCBEVT1LAT signal.   0  The DCBEVT1LAT latch is cleared.   1  The DCBEVT1LAT latch is set." range="7" rwaccess="R"/> 
		<bitfield id="EVT1LATCLRSEL" width="2" begin="6" end="5" resetval="0x0" description="DCBEVT1 Latched clear source select: 00 CNT_ZERO event clears DCBEVT1 latch. 01 PRD_EQ event clears DCBEVT1 latch. 10          CNT_ZERO event or PRD_EQ event clears DCBEVT1 latch. 11          Reserved." range="6 - 5" rwaccess="R/W"/> 
		<bitfield id="EVT1LATSEL" width="1" begin="4" end="4" resetval="0x0" description="DCBEVT1 Latched signal select: 0 Does not select the DCBEVT1 latched signal [Refer figure Modifications to DCBEVT1.force/DCBEVT2.force generation.]  as source of DCBEVT1.force. 1 Selects the DCBEVT1 latched signal as source of DCBEVT1.force." range="4" rwaccess="R/W"/> 
		<bitfield id="EVT1SYNCE" width="1" begin="3" end="3" resetval="0x0" description="DCBEVT1 SYNC, Enable/Disable   0: SYNC Generation Disabled  1: SYNC Generation Enabled" range="3" rwaccess="R/W"/> 
		<bitfield id="EVT1SOCE" width="1" begin="2" end="2" resetval="0x0" description="DCBEVT1 SOC, Enable/Disable   0: SOC Generation Disabled  1: SOC Generation Enabled" range="2" rwaccess="R/W"/> 
		<bitfield id="EVT1FRCSYNCSEL" width="1" begin="1" end="1" resetval="0x0" description="DCBEVT1 Force Synchronization Signal Select  0: Source is synchronized with EPWMCLK 1: Source is passed through asynchronously" range="1" rwaccess="R/W"/> 
		<bitfield id="EVT1SRCSEL" width="1" begin="0" end="0" resetval="0x0" description="DCBEVT1 Source Signal Select   0: Source Is DCBEVT1 Signal  1: Source Is DCEVTFILT Signal" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM12_DCFCTL" acronym="CONTROLSS_G3_EPWM12_DCFCTL" offset="0x18E" width="16" description="Digital Compare Filter Control Register">
		<bitfield id="EDGESTATUS" width="3" begin="15" end="13" resetval="0x0" description="Edge Status:  These bits reflect the total number of edges currently captured. When the value matches the EDGECOUNT, the status bits are set to zero. and a TBCLK wide pulse is generated which can then be output on the DCEVTFILT signal. The edge counter can be reset by writing 000 to the EDGECOUNT value:" range="15 - 13" rwaccess="R"/> 
		<bitfield id="EDGECOUNT" width="3" begin="12" end="10" resetval="0x0" description="Edge Count: These bits select how many edges to count before generating a TBCLK wide pulse on the DCEVTFILT signal: 000: no edges, reset current EDGESTATUS bits to 0,0,0 001: 1 edge 010: 2 edges 011: 3 edges 100: 4 edges 101: 5 edges 110: 6 edges 111: 7 edges" range="12 - 10" rwaccess="R/W"/> 
		<bitfield id="EDGEMODE" width="2" begin="9" end="8" resetval="0x0" description="Edge Mode Select: 00: Low To High Edge 01: High To Low Edge 10: Both Edges 11: Reserved" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="EDGEFILTSEL" width="1" begin="6" end="6" resetval="0x0" description="Edge Filter Select: 0: Edge Filter Not Selected 1: Edge Filter Selected" range="6" rwaccess="R/W"/> 
		<bitfield id="PULSESEL" width="2" begin="5" end="4" resetval="0x0" description="Pulse Select For Blanking &#38; Capture Alignment   00: Time-base counter equal to period [TBCTR = TBPRD]  01: Time-base counter equal to zero [TBCTR = 0x00]  10: Time-base counter equal to zero [TBCTR = 0x00] or period [TBCTR = TBPRD]  11: Blank Pulse Mix" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="BLANKINV" width="1" begin="3" end="3" resetval="0x0" description="Blanking Window Inversion   0: Blanking window not inverted  1: Blanking window inverted" range="3" rwaccess="R/W"/> 
		<bitfield id="BLANKE" width="1" begin="2" end="2" resetval="0x0" description="Blanking Window Enable/Disable   0: Blanking window is disabled  1: Blanking window is enabled" range="2" rwaccess="R/W"/> 
		<bitfield id="SRCSEL" width="2" begin="1" end="0" resetval="0x0" description="Filter Block Signal Source Select   00: Source Is DCAEVT1 Signal  01: Source Is DCAEVT2 Signal  10: Source Is DCBEVT1 Signal  11: Source Is DCBEVT2 Signal" range="1 - 0" rwaccess="R/W"/>
	</register>
